let sdkStatusNotify = {
  0: "SDK初始化成功",
  1: "连接本地守护进程失败，通过重新加载页面的方式初始化SDK",
  2: "表示连接本地媒体服务失败，通过重新加载页面的方式初始化SDK",
  3: "获取本地ip失败，通过重新加载页面的方式初始化SDK",
  4: "获取本地摄像头失败，通过重新加载页面的方式初始化SDK",
};

let sameStatus = {
  10000: "服务端，用户鉴权失败，需要重新登录。",
  10001: "服务端参数校验不合法，请检查参数。",
  10002: "服务端异常，请联系管理员。",
  "-1": "请求发送到服务器的失败的异常。",
  "-2": "请求参数校验不合法。",
  "-3": "用户尚未登录",
};

let voiceDial = {
  "-4": "存在一个通话正在振铃，应答通话之前不能发起点呼。",
  "-5": "并发数量超出规定数量",
  "-6": "与其他通话业务冲突",
  ...sameStatus,
};

let voiceAnswer = {
  "-4": "通话并发数量受到限制",
  "-5": "当前有通话业务与该业务冲突",
  ...sameStatus,
};

let voiceReject = {
  "-4": "无法拒接该cid，该cid对应的呼叫可能在通话中。",
  ...sameStatus,
};

let voiceRelease = {
  "-4": "被叫不能挂断正在振铃的呼叫",
  ...sameStatus,
};

let videoDial = {
  "-4": "存在一个通话正在振铃，响应之前不能发起点呼。",
  "-5": "当前摄像头不支持该分辨率",
  "-7": "视频能力有限",
  "-8": "与其他通话业务冲突",
  ...sameStatus,
};

let videoAnswer = {
  "-4": "该cid可能已经在通话中。",
  "-6": "当前有通话业务与该业务冲突",
  "-7": "视频能力有限",
  ...sameStatus,
};

let videoReject = {
  "-4": "该cid可能已经在通话中。",
  ...sameStatus,
};

let videoRelease = {
  "-4": "被叫不能挂断正在振铃的通话",
  ...sameStatus,
};

let videoMonitor = {
  "-5": "并发数量超出规定数量",
  ...sameStatus,
};

let loginStatus = {
  "-1": "请求发送到服务器的失败的异常。",
  "-2": "请求参数校验不合法。",
  "-3": "SDK还在初始化中，请稍后再试。",
  "-4": "SDK初始化异常，无法获取本地IP。",
  "-5": "SDK初始化异常，无法获取摄像头信息。",
  "-6": "缺少eUDC ip与port信息，请查看SDK初始化",
  101: "统一账号或密码错误",
  103: "用户被锁定",
  104: "首次登录需要修改密码",
  4016: "同一个用户号，并发同时登录，会引起资源冲突，请稍后再试。",
  4018: "License受限。",
  4100: "用户已登录。可以设置force为true进行强制登录。",
};

let dialStatus = {
  2002: "语音呼入振铃事件",
  2005: "语音外呼事件",
  3002: "视频呼入振铃事件",
  3004: "视频外呼事件",
  3011: "视频分发呼入振铃事件",
  2006: "语音呼出回铃事件",
  3005: "视频呼出回铃事件",
  2003: "语音呼出通话事件",
  2007: "语音呼入通话事件",
  3003: "视频呼出通话事件",
  3006: "视频呼入通话事件",
  2013: "表示被叫忙",
  2016: "表示没有权限外呼",
  2017: "表示被叫没有应答，超时",
  2018: "表示被叫号码不存在",
  2024: "表示被叫号码未在线或被叫号码挂断呼叫",
  2049: "表示对端不支持该操作",
  2052: "表示被叫号码没有呼入权限",
  2023: "表示对端不支持所需的音频格式",
  2033: "表示远程断电",
  2048: "表示本端不支持该操作",
  3013: "表示对端忙",
  3014: "表示没有视频点呼权限",
  3015: "表示对端超时",
  3016: "表示对端号码不存在",
  3021: "表示对端未在线或被对端挂断呼叫",
  3044: "表示本端不支持该操作",
  3045: "表示对端不支持该操作，可能是没有权限，或者是不支持该分辨率",
  3048: "表示对端没有权限",
  2040: "语音呼入应答事件",
  2041: "半双工呼入应答事件",
  3040: "视频呼入应答事件",
};

let otherStatus = -{
"-1":" sdkserver服务端接口调用失败。",
"-999":  "-MDC错误",
"1003":  "sdkserver请求-超时错误。",
"1004":  "sdkserver服务忙，流量被控制",
"-40001":  "操作不被接受，操作状态不正确，缺少必要的前提",
"-40002":  "操作不被接受，因为没有该资源",
"-40003":  "操作不被接受，因为对应资源不支持该操作能力",
  "-40004":  "操作不被接受，因为超出APP处理能力",
  "-40005":  "操作不被接受，因为用户在对应资源上没有权限做该操作",
  "-40006":  "操作不被接受, 业务并发受限",
  "-40007":  "操作不被接受, IP地址不合法",
  "-40008":  "操作不被接受, IP地址不合法",
  "-40009":  "操作执行成功",
  "-40010":  "执行组呼释放错误",
  "-40011":  "操作不被接受,组没有被订阅",
  "-40012":  "媒体面失败，检查MIC是否插入",
  "-40013":  "端口分配失败，无可用端口供分配",
  "-40093":  "该路呼叫正在被转接",
  "-40094":  "找不到归属地（用户在ZONE号段外）",
  "-40095":  "找到了用户的归属地, 但与归属地MDC之间断链",
  "-40096":  "服务器端响应超时",
  "-40097":  "服务器端返回错误, 操作被调度机拒绝",
  "-40098":  "操作不被接受,原因不明",
  "-40099":  "操作未实现， 可能在未来版本实现",
  "-40100":  "OSIP信令处理内部错误",
  "-40101":  "MS2媒体处理内部错误",
  "-40102":  "ZMQ命令处理内部错误",
  "-40103":  "定时器处理内部错误",
  "-40104":  "参数错误",
  "-40105":  "LICENSE超出限制",
  "-40106":  "已经存在，重复分发",
  "-40107":  "该用户不存在",
  "-40108":  "该用户没有注册",
  "-40109":  "定时器调度失败",
  "-40110":  "调度机转接失败",
  "-40111":  "用户数量超出最大限制",
  "-40112":  "动态组创建时使用了错误的动态组号码",
  "-40113":  "动态组的成员超出范围",
  "-40114":  "动态组创建超时",
  "-40115":  "动态组中组成员超出范围限制",
  "-40116":  "动态组中有成员没有注册",
  "-40117":  "版本不匹配",
  "-40118":  "动态组已经存在",
  "-40119":  "没有任何有效的用户在动态组内，请检测是否包含外部组或者外部用户",
  "-40120":  "在创建动态组的时候网络返回错误",
  "-40121":  "目标正在通话中，拒绝调度台抢话",
  "-40122":  "该视频源转发的数量已经超过系统限制",
  "-40124":  "版本不支持",
  "-40125":  "不允许下载",
  "-40126":  "号码错误",
  "-40131":  "调度员超过最大创建派接数",
  "-40132":  "紧急呼叫不支持强拆",
  "-40133":  "不支持强拆操作",
  "-40134":  "本地IP地址无效",
  "-40137":  "后台服务无响应或动态组还在建立中，请稍后查看",
  "-40138":  "动态组操作eUDC错误",
  "-40139":  "动态组操作无效的索引号码",
  "-40140":  "动态组操作eUDC同步失败",
  "-40141":  "动态组操作eUDC超时",
  "-40142":  "动态组OR修改密码操作eUDC认证失败",
  "-40143":  "动态组OR修改密码操作eUDC内部错误",
  "-40144":  "派接组号码获取失败",
  "-40145":  "临时组号码获取失败",
  "-40146":  "修改密码失败：旧密码验证失败",
  "-40147":  "修改密码失败：新密码不合法",
  "-40148":  "修改密码失败：用户号无效",
  "-40149":  "修改密码失败：未知错误",
  "-40151":  "视频分发或转接失败：vpn不支持",
  "-40152":  "创建派接组达到系统最大数量,100",
  "-40153":  "临时用户当前只支持网关用户",
  "-40154":  "转码繁忙，请尝试不转码发送",
  "-40155":  "调度机取消转接未允许",
  "-40156":  "调度机已完成取消转接",
  "-40157":  "调度机取消转接失败",
  "-40158":  "无权限",
  "-40159":  "用户不支持",
  "-40162":  "派接组用户成员超限",
  "-40163":  "GIS权限配置超时",
  "-40164":  "会话存在",
  "-40166":  "操作不被接受，因为正在请求保持呼叫中",
  "-40200":  "会议不存在",
  "-40201":  "已经登陆",
  "-40202":  "未加入会议",
  "-40203":  "不是会议主席",
  "-40204":  "正在创建会议",
  "-40205":  "音视频会议SMC接口调用失败",
}

export {
  sdkStatusNotify,
  voiceDial,
  voiceAnswer,
  voiceReject,
  voiceRelease,
  videoDial,
  videoAnswer,
  videoReject,
  videoRelease,
  videoMonitor,
  sameStatus,
  loginStatus,
  dialStatus,
  otherStatus
};
